wwdh_yii2_sourcecode/frontend/controllers/SiteController.php

SELECT COUNT(*) FROM `post`
SELECT * FROM `post` ORDER BY `date` DESC LIMIT 20
SELECT * FROM `user`
---
    public function actionIndex()
    {
        $query=Post::find();
        $pagination=new Pagination([
            'defaultPageSize'=>20,
            'totalCount'=>$query->count(),
        ]);

        $posts=$query->orderBy(['date'=> SORT_DESC])->offset($pagination->offset)->limit($pagination->limit)->all();
        $users=User::find()->all();

SELECT * FROM `post` WHERE `post_id`='5'
UPDATE `post` SET `attendence`=`attendence`+1 WHERE `post_id`=5
SELECT * FROM `user` WHERE `id`=2
---
    public function actionPost($post_id)
    {
        $post=Post::findOne($post_id);
        $post->updateCounters(['attendence'=>1]);
        $user=User::findOne($post->user_id);

SELECT * FROM `user` WHERE `id`='2'
UPDATE `user` SET `username`='tesztelek', `email`='tesztelek@email.cim' WHERE id=2
---
    public function actionSettings($user_id)
    {
        $user=User::findOne($user_id);
        //$model= SignupForm::findModel($user_id);

        if($user->load(Yii::$app->request->post()) && $user->save()){